{
  "title": "Data Science Engineer",
  "company": "Persistent Careers",
  "location": "Pune, Bengaluru",
  "experience": "5+ Years",
  "education": "Education UG: B.Tech/B.E. in Computers PG: M.Tech in Computers",
  "skills": [
    "Data Science",
    "Artificial Intelligence",
    "Machine Learning",
    "GEN AI",
    "LangChain",
    "LangGraph",
    "MLOps Architecture Strategy",
    "Prompt engineering",
    "MLflow",
    "Kubeflow",
    "SageMaker",
    "Vertex AI",
    "Docker",
    "Kubernetes",
    "AWS",
    "Azure",
    "GCP",
    "Python",
    "TensorFlow",
    "PyTorch",
    "scikit-learn",
    "CI/CD",
    "Infrastructure as code",
    "Automation tools"
  ],
  "description": "Job description About Position:   We are conducting an in-person hiring drive for the position of Mlops / Data Science in Pune & Bengaluru on 2nd August 2025.Interview Location is mentioned below: Pune  Persistent Systems, Veda Complex, Rigveda-Yajurveda-Samaveda-Atharvaveda Plot No. 39, Phase I, Rajiv Gandhi Information Technology Park, Hinjawadi, Pune, 411057 Bangalore - Persistent Systems, The Cube at Karle Town Center Rd, DadaMastan Layout, Manayata Tech Park, Nagavara, Bengaluru, Karnataka 560024 We are looking for an experienced and talented Data Science to join our growing data competency team. The ideal candidate will have a strong background in working with GEN AI , ML ,LangChain, LangGraph, Mlops Architecture Strategy, Prompt engineering. You will work closely with our data analysts, engineers, and business teams to ensure optimal performance, scalability, and availability of our data pipelines and analytics. Role: Data Science Job Location: All PSL Location   Experience: 5+ Years Job Type: Full Time Employment What You'll Do:   Design, build, and manage scalable ML model deployment pipelines (CI/CD for ML). Automate model training, validation, monitoring, and retraining workflows. Implement model governance, versioning, and reproducibility best practices. Collaborate with data scientists, engineers, and product teams to operationalize ML solutions. Ensure robust monitoring and performance tuning of deployed models Expertise You'll Bring:   Strong experience with MLOps tools & frameworks (MLflow, Kubeflow, SageMaker, Vertex AI, etc.). Proficient in containerization (Docker, Kubernetes). Good knowledge of cloud platforms (AWS, Azure, or GCP). Expertise in Python and familiarity with ML libraries (TensorFlow, PyTorch, scikit-learn). Solid understanding of CI/CD, infrastructure as code, and automation tools. Benefits: Competitive salary and benefits package Culture focused on talent development with quarterly promotion cycles and company-sponsored higher education and certifications Opportunity to work with cutting-edge technologies Employee engagement initiatives such as project parties, flexible work hours, and Long Service awards Annual health check-ups Insurance coverage: group term life, personal accident, and Mediclaim hospitalization for self, spouse, two children, and parents Inclusive Environment: Persistent Ltd. is dedicated to fostering diversity and inclusion in the workplace. We invite applications from all qualified individuals, including those with disabilities, and regardless of gender or gender preference. We welcome diverse candidates from all backgrounds. We offer hybrid work options and flexible working hours to accommodate various needs and preferences. Our office is equipped with accessible facilities, including adjustable workstations, ergonomic chairs, and assistive technologies to support employees with physical disabilities. If you are a person with disabilities and have specific requirements, please inform us during the application process or at any time during your employment. We are committed to creating an inclusive environment where all employees can thrive. Our company fosters a values-driven and people-centric work environment that enables our employees to: Accelerate growth, both professionally and personally Impact the world in powerful, positive ways, using the latest technologies Enjoy collaborative innovation, with diversity and work-life wellbeing at the core Unlock global opportunities to work and learn with the industry's best Lets unleash your full potential at Persistent \" Persistent is an Equal Opportunity Employer and prohibits discrimination and harassment of any kind. \" Role:  IT Infrastructure Services - Other , Industry Type:  IT Services & Consulting , Department:  IT & Information Security , Employment Type:  Full Time, Permanent Role Category:  IT Infrastructure Services Education UG:  B.Tech/B.E. in Computers PG:  M.Tech in Computers read more Key Skills Skills highlighted with '' are preferred keyskills Data Science Artificial Intelligence Machine Learning",
  "others": "Role: IT Infrastructure Services - Other, Industry Type: IT Services & Consulting, Department: IT & Information Security, Employment Type: Full Time, Permanent, Role Category: IT Infrastructure Services"
}